[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:28:17
 
         void Add(Guid apiId, Guid provider, Guid? viaApp)
         {
-            if (!providersByApi.TryGetValue(apiId, out var set))
+            if (providersByApi.TryGetValue(apiId, out var set))
                 providersByApi[apiId] = set = [];
             set.Add((provider, viaApp));
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:30:13
         {
             if (!providersByApi.TryGetValue(apiId, out var set))
                 providersByApi[apiId] = set = [];
-            set.Add((provider, viaApp));
+            ;
         }
 
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:33:53
             set.Add((provider, viaApp));
         }
 
-        foreach (var (svc, api) in serviceProvides) Add(api, svc, null);
+        foreach (var (svc, api) in serviceProvides) ;
 
         // instance-of ⋈ app-provides: service T instance-of App A, A provides X → T exposes X via A.
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths; Kartova.Catalog.Tests.DerivedDependenciesTests.multiple_apis_collapse_to_one_edge_with_multiple_paths
statusReason: Mutant changed compared to target commit

[Killed] Negate expression
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:40:17
             .GroupBy(x => x.AppId)
             .ToDictionary(g => g.Key, g => g.Select(x => x.ApiId).ToList());
         foreach (var (svc, app) in instanceOf)
-            if (appProvidesByApp.TryGetValue(app, out var apis))
+            if (!(appProvidesByApp.TryGetValue(app, out var apis)))
                 foreach (var api in apis)
                     Add(api, svc, app);
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths; Kartova.Catalog.Tests.DerivedDependenciesTests.paths_are_deterministically_ordered
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:42:21
         foreach (var (svc, app) in instanceOf)
             if (appProvidesByApp.TryGetValue(app, out var apis))
                 foreach (var api in apis)
-                    Add(api, svc, app);
+                    ;
 
         // For each (S consumes X) and each provider (T, viaApp) of X with S != T, collect a path.
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths; Kartova.Catalog.Tests.DerivedDependenciesTests.paths_are_deterministically_ordered
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:48:70
         var pathsByPair = new Dictionary<(Guid S, Guid T), List<Path>>();
         foreach (var (consumer, api) in consumes)
         {
-            if (!providersByApi.TryGetValue(api, out var providers)) continue;
+            if (!providersByApi.TryGetValue(api, out var providers)) ;
             foreach (var (provider, viaApp) in providers)
             {
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.consumer_without_matching_provider_yields_nothing
statusReason: Mutant changed compared to target commit

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:48:17
         var pathsByPair = new Dictionary<(Guid S, Guid T), List<Path>>();
         foreach (var (consumer, api) in consumes)
         {
-            if (!providersByApi.TryGetValue(api, out var providers)) continue;
+            if (providersByApi.TryGetValue(api, out var providers)) continue;
             foreach (var (provider, viaApp) in providers)
             {
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:51:21
             if (!providersByApi.TryGetValue(api, out var providers)) continue;
             foreach (var (provider, viaApp) in providers)
             {
-                if (provider == consumer) continue;                          // no self-edge
+                if (provider != consumer) continue;                          // no self-edge
                 if (explicitDependsOn.Contains((consumer, provider))) continue; // explicit wins
                 var key = (consumer, provider);
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:51:43
             if (!providersByApi.TryGetValue(api, out var providers)) continue;
             foreach (var (provider, viaApp) in providers)
             {
-                if (provider == consumer) continue;                          // no self-edge
+                if (provider == consumer) ;                          // no self-edge
                 if (explicitDependsOn.Contains((consumer, provider))) continue; // explicit wins
                 var key = (consumer, provider);
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.self_dependency_is_never_emitted
statusReason: Mutant changed compared to target commit

[Killed] Negate expression
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:52:21
             foreach (var (provider, viaApp) in providers)
             {
                 if (provider == consumer) continue;                          // no self-edge
-                if (explicitDependsOn.Contains((consumer, provider))) continue; // explicit wins
+                if (!(explicitDependsOn.Contains((consumer, provider)))) continue; // explicit wins
                 var key = (consumer, provider);
                 if (!pathsByPair.TryGetValue(key, out var list))
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:52:71
             foreach (var (provider, viaApp) in providers)
             {
                 if (provider == consumer) continue;                          // no self-edge
-                if (explicitDependsOn.Contains((consumer, provider))) continue; // explicit wins
+                if (explicitDependsOn.Contains((consumer, provider))) ; // explicit wins
                 var key = (consumer, provider);
                 if (!pathsByPair.TryGetValue(key, out var list))
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.explicit_depends_on_suppresses_derived_edge_for_that_pair; Kartova.Catalog.IntegrationTests.GetCatalogGraphTests.explicit_depends_on_suppresses_the_derived_duplicate
statusReason: Mutant changed compared to target commit

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:54:21
                 if (provider == consumer) continue;                          // no self-edge
                 if (explicitDependsOn.Contains((consumer, provider))) continue; // explicit wins
                 var key = (consumer, provider);
-                if (!pathsByPair.TryGetValue(key, out var list))
+                if (pathsByPair.TryGetValue(key, out var list))
                     pathsByPair[key] = list = [];
                 list.Add(new Path(api, viaApp));
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/DerivedDependencies.cs:56:17
                 var key = (consumer, provider);
                 if (!pathsByPair.TryGetValue(key, out var list))
                     pathsByPair[key] = list = [];
-                list.Add(new Path(api, viaApp));
+                ;
             }
         }
killedBy: Kartova.Catalog.Tests.DerivedDependenciesTests.direct_provide_path_yields_edge_with_null_via_app; Kartova.Catalog.Tests.DerivedDependenciesTests.via_app_path_yields_edge_with_via_app_populated; Kartova.Catalog.Tests.DerivedDependenciesTests.same_api_direct_and_via_app_dedupes_to_two_distinct_paths
statusReason: Mutant changed compared to target commit
