[Killed] Boolean mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:29:25
 
         var nodeDepth = new Dictionary<(EntityKind, Guid), int> { [Key(focus)] = 0 };
         var keptEdges = new Dictionary<Guid, GraphTraversalEdge>();
-        var truncated = false;
+        var truncated = true;
         var frontier = new List<EntityRef> { focus };
 
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.focus_with_no_edges_returns_only_focus
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:32:29
         var truncated = false;
         var frontier = new List<EntityRef> { focus };
 
-        for (var level = 0; level < depth && frontier.Count > 0; level++)
+        for (var level = 0; level > depth && frontier.Count > 0; level++)
         {
             var edges = await fetchEdgesTouching(frontier, ct);
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths; Kartova.Catalog.Tests.GraphTraversalTests.depth_1_excludes_the_second_hop; Kartova.Catalog.Tests.GraphTraversalTests.outgoing_only_follows_source_to_target
statusReason: Mutant changed compared to target commit

[Killed] Logical mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:32:29
         var truncated = false;
         var frontier = new List<EntityRef> { focus };
 
-        for (var level = 0; level < depth && frontier.Count > 0; level++)
+        for (var level = 0; level < depth || frontier.Count > 0; level++)
         {
             var edges = await fetchEdgesTouching(frontier, ct);
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_1_excludes_the_second_hop
statusReason: Mutant changed compared to target commit

[Killed] Conditional (false) mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:45:55
                 var tgtInFrontier = inFrontier.Contains(Key(e.Target));
                 EntityRef? neighbour = direction switch
                 {
-                    RelationshipDirection.Outgoing => srcInFrontier ? e.Target : null,
+                    RelationshipDirection.Outgoing => (false?e.Target :null),
                     RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
                     _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.outgoing_only_follows_source_to_target; Kartova.Catalog.IntegrationTests.GetCatalogGraphTests.GET_graph_outgoing_excludes_incoming_neighbour; Kartova.Catalog.IntegrationTests.GetCatalogGraphTests.GET_graph_includes_cross_edges_between_kept_nodes
statusReason: Mutant changed compared to target commit

[Survived] Conditional (true) mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:45:55
                 var tgtInFrontier = inFrontier.Contains(Key(e.Target));
                 EntityRef? neighbour = direction switch
                 {
-                    RelationshipDirection.Outgoing => srcInFrontier ? e.Target : null,
+                    RelationshipDirection.Outgoing => (true?e.Target :null),
                     RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
                     _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),

[Killed] Conditional (false) mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:46:55
                 EntityRef? neighbour = direction switch
                 {
                     RelationshipDirection.Outgoing => srcInFrontier ? e.Target : null,
-                    RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
+                    RelationshipDirection.Incoming => (false?e.Source :null),
                     _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),
                 };
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.incoming_only_follows_target_to_source
statusReason: Mutant changed compared to target commit

[Survived] Conditional (true) mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:46:55
                 EntityRef? neighbour = direction switch
                 {
                     RelationshipDirection.Outgoing => srcInFrontier ? e.Target : null,
-                    RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
+                    RelationshipDirection.Incoming => (true?e.Source :null),
                     _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),
                 };

[Killed] Conditional (false) mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:47:54
                 {
                     RelationshipDirection.Outgoing => srcInFrontier ? e.Target : null,
                     RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
-                    _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),
+                    _ => srcInFrontier ? e.Target : ((false?e.Source :null)),
                 };
                 if (neighbour is null) continue;
killedBy: Kartova.Catalog.IntegrationTests.CreateRelationshipTests.POST_two_services_can_provide_the_same_api; Kartova.Catalog.IntegrationTests.GetCatalogGraphTests.GET_graph_focused_on_api_returns_provider_edge_and_enriched_api_node
statusReason: Mutant changed compared to target commit

[Killed] Conditional (false) mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:47:26
                 {
                     RelationshipDirection.Outgoing => srcInFrontier ? e.Target : null,
                     RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
-                    _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),
+                    _ => (false?e.Target :(tgtInFrontier ? e.Source : null)),
                 };
                 if (neighbour is null) continue;
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths; Kartova.Catalog.Tests.GraphTraversalTests.depth_1_excludes_the_second_hop; Kartova.Catalog.Tests.GraphTraversalTests.cap_truncates_and_flags
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:49:21
                     RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
                     _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),
                 };
-                if (neighbour is null) continue;
+                if (neighbour is not null) continue;
 
                 var nb = neighbour.Value;
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths; Kartova.Catalog.Tests.GraphTraversalTests.depth_1_excludes_the_second_hop; Kartova.Catalog.Tests.GraphTraversalTests.outgoing_only_follows_source_to_target
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:49:40
                     RelationshipDirection.Incoming => tgtInFrontier ? e.Source : null,
                     _ => srcInFrontier ? e.Target : (tgtInFrontier ? e.Source : null),
                 };
-                if (neighbour is null) continue;
+                if (neighbour is null) ;
 
                 var nb = neighbour.Value;
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.outgoing_only_follows_source_to_target; Kartova.Catalog.Tests.GraphTraversalTests.incoming_only_follows_target_to_source; Kartova.Catalog.IntegrationTests.GetCatalogGraphTests.GET_graph_outgoing_excludes_incoming_neighbour
statusReason: Mutant changed compared to target commit

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:52:21
                 if (neighbour is null) continue;
 
                 var nb = neighbour.Value;
-                if (!nodeDepth.ContainsKey(Key(nb)))
+                if (nodeDepth.ContainsKey(Key(nb)))
                 {
                     if (nodeDepth.Count >= maxNodes) { truncated = true; continue; }
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths; Kartova.Catalog.Tests.GraphTraversalTests.depth_1_excludes_the_second_hop; Kartova.Catalog.Tests.GraphTraversalTests.outgoing_only_follows_source_to_target
statusReason: Mutant changed compared to target commit

[Killed] Negate expression
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:54:25
                 var nb = neighbour.Value;
                 if (!nodeDepth.ContainsKey(Key(nb)))
                 {
-                    if (nodeDepth.Count >= maxNodes) { truncated = true; continue; }
+                    if (!(nodeDepth.Count >= maxNodes)) { truncated = true; continue; }
                     nodeDepth[Key(nb)] = level + 1;
                     next.Add(nb);
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths; Kartova.Catalog.Tests.GraphTraversalTests.depth_1_excludes_the_second_hop; Kartova.Catalog.Tests.GraphTraversalTests.outgoing_only_follows_source_to_target
statusReason: Mutant changed compared to target commit

[Killed] Boolean mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:54:68
                 var nb = neighbour.Value;
                 if (!nodeDepth.ContainsKey(Key(nb)))
                 {
-                    if (nodeDepth.Count >= maxNodes) { truncated = true; continue; }
+                    if (nodeDepth.Count >= maxNodes) { truncated = false; continue; }
                     nodeDepth[Key(nb)] = level + 1;
                     next.Add(nb);
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.cap_truncates_and_flags
statusReason: Mutant changed compared to target commit

[Killed] Arithmetic mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:55:42
                 if (!nodeDepth.ContainsKey(Key(nb)))
                 {
                     if (nodeDepth.Count >= maxNodes) { truncated = true; continue; }
-                    nodeDepth[Key(nb)] = level + 1;
+                    nodeDepth[Key(nb)] = level - 1;
                     next.Add(nb);
                 }
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:56:21
                 {
                     if (nodeDepth.Count >= maxNodes) { truncated = true; continue; }
                     nodeDepth[Key(nb)] = level + 1;
-                    next.Add(nb);
+                    ;
                 }
             }
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths
statusReason: Mutant changed compared to target commit

[Killed] Logical mutation
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:76:17
         var allTouching = await fetchEdgesTouching(keptRefs, ct);
         foreach (var e in allTouching)
         {
-            if (nodeDepth.ContainsKey(Key(e.Source)) && nodeDepth.ContainsKey(Key(e.Target)))
+            if (nodeDepth.ContainsKey(Key(e.Source)) || nodeDepth.ContainsKey(Key(e.Target)))
                 keptEdges[e.Id] = e;
         }
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_1_excludes_the_second_hop; Kartova.Catalog.Tests.GraphTraversalTests.cap_truncates_and_flags
statusReason: Mutant changed compared to target commit

[Killed] Negate expression
Modules/Catalog/Kartova.Catalog.Application/GraphTraversal.cs:76:17
         var allTouching = await fetchEdgesTouching(keptRefs, ct);
         foreach (var e in allTouching)
         {
-            if (nodeDepth.ContainsKey(Key(e.Source)) && nodeDepth.ContainsKey(Key(e.Target)))
+            if (!(nodeDepth.ContainsKey(Key(e.Source)) && nodeDepth.ContainsKey(Key(e.Target))))
                 keptEdges[e.Id] = e;
         }
killedBy: Kartova.Catalog.Tests.GraphTraversalTests.depth_2_discovers_two_hops_with_correct_depths; Kartova.Catalog.Tests.GraphTraversalTests.cycle_terminates_with_one_node_per_entity; Kartova.Catalog.Tests.GraphTraversalTests.cap_truncates_and_flags
statusReason: Mutant changed compared to target commit
